#pragma once
#include"common.h"
//预先声明Button是一个类
class Button;
//定义数独类,其中包含数据成员array<array<int, 9>, 9>九宫格二维数组,存储数独的内容
//以及vector<pair<bool, Button*>> 按钮类的数组,相当于存储数独内容的容器;
class Sudoku
{
public:
	Sudoku();//构造函数
	//画出数独的显示页面
	void DrawMap();
	//返回鼠标点击的是哪一个按钮,类似于指针
	int ClickButton(ExMessage& msg);
	//通过鼠标点击来调用设置文本函数
	void Mouse_to_text(ExMessage& msg);
	//判断该数独是否成立,成立则退出游戏
	bool gameover();
protected:
	array<array<int, 9>, 9> map =
	{
		3,0,6,4,5,1,8,7,9,
		0,4,5,7,0,9,2,0,0,
		7,0,9,2,0,0,1,4,5,
		0,0,3,5,4,7,6,9,0,
		0,0,0,0,9,0,0,1,2,
		6,0,8,0,2,3,4,0,0,
		5,0,1,0,0,2,9,6,4,
		8,6,4,0,0,5,7,2,3,
		9,7,2,3,6,4,0,8,0
	};

	/*{
		数独的内容:
		3,0,6,4,5,1,8,7,9,
		0,4,5,7,0,9,2,0,0,
		7,0,9,2,0,0,1,4,5,
		0,0,3,5,4,7,6,9,0,
		0,0,0,0,9,0,0,1,2,
		6,0,8,0,2,3,4,0,0,
		5,0,1,0,0,2,9,6,4,
		8,6,4,0,0,5,7,2,3,
		9,7,2,3,6,4,0,8,0

		数独的正确答案:
		3,2,6,4,5,1,8,7,9,
		1,4,5,7,8,9,2,3,6,
		7,8,9,2,3,6,1,4,5,
		2,1,3,5,4,7,6,9,8,
		4,5,7,6,9,8,3,1,2,
		6,9,8,1,2,3,4,5,7,
		5,3,1,8,7,2,9,6,4,
		8,6,4,9,1,5,7,2,3,
		9,7,2,3,6,4,5,8,1
	}*/

	//存放按钮,为每一个按钮配备一个可否修改的标记bool
	vector<pair<bool, Button*>> buttons_vec;

};
